In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("marks.csv")

In [3]:
df

   sno     name  physics  maths  chemistry
0    1  rhydham       67     78         89
1    2   khushi       56     67         78

In [4]:
df.describe()

            sno    physics      maths  chemistry
count  2.000000   2.000000   2.000000   2.000000
mean   1.500000  61.500000  72.500000  83.500000
std    0.707107   7.778175   7.778175   7.778175
min    1.000000  56.000000  67.000000  78.000000
25%    1.250000  58.750000  69.750000  80.750000
50%    1.500000  61.500000  72.500000  83.500000
75%    1.750000  64.250000  75.250000  86.250000
max    2.000000  67.000000  78.000000  89.000000